import InsService from '@/components/templates/insurance/InsService';
import InsText from '@/components/templates/insurance/InsText';
import InsTitle from '@/components/templates/insurance/InsTitle';
import React from 'react';

const app = () => {
    return (
        <div>
            <div className='h-[340px] w-full bg-[url("/images/insuranceBg.png")] text-white bg-cover bg-no-repeat'></div>
            <div className='mt-8 w-[85%] mx-auto'>
                <InsTitle title='بیمه مسافرتی چیست' />
                <InsText>
                    بیمه مسافرتی (Travel Insurance) یک نوع بیمه است که برای پوشش
                    هزینه‌ها و خسارات مرتبط با سفرهای بین‌المللی یا داخلی ارائه
                    می‌شود. این بیمه معمولاً توسط شرکت‌های بیمه عرضه می‌شود
                    <br />و شامل تعدادی پوشش است که می‌تواند شامل پوشش هزینه‌های
                    پزشکی اضطراری، پوشش لغو سفر، پوشش بیمه مسافرتی برای خسارت
                    اموال، مسئولیت مدنی و پوشش تأخیرات و لغو پرواز باشد.
                    <br />
                    یکی از اصلی‌ترین پوشش‌های بیمه مسافرتی پوشش هزینه‌های پزشکی
                    است. اگر در سفر به بیماری یا حادثه‌ای برخورد کنید و نیاز به
                    درمان داشته باشید، بیمه مسافرتی ممکن است هزینه‌های مرتبط با
                    ویزیت پزشک، بستری در بیمارستان، داروها و معالجه‌های دیگر را
                    پوشش دهد
                </InsText>
                <div className='mt-14'>
                    <InsTitle title='خدمات بیمه مسافرتی' />
                </div>
                <InsText>
                    خدمات بیمه مسافرتی شامل مجموعه‌ای از خدماتی هستند که توسط
                    شرکت‌های بیمه به بیمه‌گزاران ارائه می‌شوند. این خدمات در
                    ارتباط با موارد مختلفی از جمله پوشش‌ها، مشاوره‌ها و خدمات
                    اضافی مرتبط با سفرها ارائه می‌شود. به طور کلی، خدمات بیمه
                    مسافرتی عبارتند از:
                </InsText>
                <div className='flex flex-col gap-y-2 mt-2'>
                    <InsService
                        icon='medical'
                        title='هزینه های پزشکی:'
                        desc='هزینه مراقبت پزشکی و بستری در بیمارستان برای
                                درمان بیماری‌ها یا حوادث و صدمات مختلف.'
                    />
                    <InsService
                        icon='dental'
                        title='هزینه های دندانپزشکی:'
                        desc=' درمان ضروری برای درمان عفونت شدید، دندان درد، کشیدن دندان
                        و...'
                    />
                    <InsService
                        icon='pharmacySquare'
                        title='جبران هزینه دارو'
                        desc='در صورت مفقود شدن داروهای همراه مسافر(به شرط ضروری بودن مصرف آن‌ها) و ارسال مجدد داروهای مورد نیاز بیمه‌شده.'
                    />
                    <InsService
                        icon='airplane3'
                        title='هزینه‌های بازگشت:'
                        desc='در صورت ابتلا به بیماری یا وقوع حادثه‌ای که بیش از 10 روز نیاز به بستری شدن در بیمارستان داشته باشد.'
                    />
                    <InsService
                        icon='cartTick'
                        title='جبران خسارت اموال:'
                        desc='بیمهه مسافرتی می‌تواند در صورت خسارت، سرقت یا از دست رفتن وسایل شخصی و اموال شما در سفر تأمین کند'
                    />
                </div>
                <div className='mt-14 mb-4'>
                    <InsTitle title='مبلغ بیمه مسافرتی' />
                    <div className='flex flex-col gap-y-4'>
                        <InsText>
                            قیمت بیمه مسافرتی بر اساس عوامل متعددی تعیین می‌شود.
                            در زیر به برخی از اصلی‌ترین عواملی که بر قیمت بیمه
                            مسافرتی تأثیر می‌گذارند، اشاره شده است.
                        </InsText>
                        <InsService
                            title='مقصد سفر:'
                            desc='
                        مقصد سفر یکی از عوامل اصلی در تعیین قیمت بیمه مسافرتی است. برخی مقاصد سفر به دلیل خطرات بیشتر، هزینه درمان بالاتر یا موارد دیگر، قیمت بیمه بیشتری دارند.'
                        />
                        <InsService
                            title='مدت زمان سفر:'
                            desc='مدت زمان سفر نیز تأثیر قابل توجهی در قیمت بیمه دارد. معمولاً هرچه مدت زمان سفر بیشتر باشد، قیمت بیمه مسافرتی نیز بالاتر خواهد بود
                            '
                        />
                        <InsService
                            title='سن و تعداد مسافران:'
                            desc='سن و تعداد مسافران ممکن است نیز تاثیرگذار باشند.برخی بیمه گزاران در سنین بالا ممکن است قیمت بیمه بیشتری داشته باشند.'
                        />
                    </div>
                </div>
            </div>
        </div>
    );
};

export default app;
