import Step from '@/components/templates/steps/step';
import React from 'react';

const page = () => {
    return (
        <div className='w-[85%] mx-auto'>
            <p className='text-gray-9 font-ISBold text-2xl'>
                مراحل خرید آنلاین بلیط هواپیما
            </p>
            <div className='mt-[3.75rem]'>
                <div className='space-y-4' >
                    <Step
                        icon='searchNormal'
                        title='جستجوی بلیط'
                        desc='در بخش جستجو، نوع سفر ‏(یکطرفه یا رفت و برگشت)‏ و مبدأ و مقصد خود را وارد کنید، تاریخ سفر را انتخاب کنید و تعداد مسافران را مشخص کنید.'
                    />
                    <Step
                        icon='airplane2'
                        title='انتخاب پرواز'
                        desc=' بر اساس اطلاعاتی که وارد کرده‌اید، نتایجی شامل لیست پروازها و قیمت‌ها نمایش داده می‌شود. می‌توانید پروازهای مختلف را بررسی کنید و براساس ترجیحات خود،یک پرواز را انتخاب کنید'
                    />
                    <Step
                        icon='tickSquare'
                        title='انتخاب صندلی'
                        desc='پس از انتخاب پرواز،شما باید صندلی یا صندلی های مورد نظرخود راانتخاب کنید .'
                    />
                    <Step
                        icon='note'
                        title='اطلاعات مسافران'
                        desc='دراین مرحله باید اطلاعات مسافران را وارد کنید.این اطلاعات شامل نام ونام خانوادگی ،جنسیت ،تاریخ تولد واطلاعات تماس می باشد.'
                    />
                    <Step
                        icon='cardPos'
                        title='تایید وپرداخت'
                        desc='دراین مرحله باید هزینه بلیط را پرداخت کنید. شما میتوانیدبا کارت بانکی،که رمز پویا دارد وارد درگاه پرداخت شده وپس از پرداخت موفق،بلیط شما تایید می شود ویک بلیط الکترونیکی به شما ارائه می شود.'
                    />
                    <Step
                        icon='ticket'
                        title='دریافت بلیط'
                        desc='پس از تایید خرید،بلیط را از وب سایت زرروشده دریافت کنید ویا آن را چاپ کنید.'
                    />
                </div>
            </div>
        </div>
    );
};

export default page;
